Autodesk.Revit.DB.SetComparisonResult
An enumerated type listing all the relationship types between two sets of arbitrary nature.

Autodesk.Revit.DB.SetComparisonResult.Equal
Two nonempty sets are equal.

Autodesk.Revit.DB.SetComparisonResult.Superset
Both sets are not empty and the left set is strict superset of the right.
Remarks: Right set is properly contained inside left set.

Autodesk.Revit.DB.SetComparisonResult.Subset
Both sets are not empty and the left set is strict subset of the right.
Remarks: Left set is properly contained inside right set.

Autodesk.Revit.DB.SetComparisonResult.Overlap
The overlap of two sets is not empty and strict subset of both.

Autodesk.Revit.DB.SetComparisonResult.Disjoint
Both sets are not empty and don't overlap.

Autodesk.Revit.DB.SetComparisonResult.BothEmpty
Both sets are empty.

Autodesk.Revit.DB.SetComparisonResult.RightEmpty
The right set is empty and the left set is not.

Autodesk.Revit.DB.SetComparisonResult.LeftEmpty
The left set is empty and the right set is not.